/* automatically generated by rust-bindgen */

#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(clippy::all)]

#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct ImVec2_Simple {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_ImVec2_Simple() {
    assert_eq!(
        ::std::mem::size_of::<ImVec2_Simple>(),
        8usize,
        concat!("Size of: ", stringify!(ImVec2_Simple))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVec2_Simple>(),
        4usize,
        concat!("Alignment of ", stringify!(ImVec2_Simple))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec2_Simple>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec2_Simple),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec2_Simple>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec2_Simple),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct ImVec4_Simple {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_ImVec4_Simple() {
    assert_eq!(
        ::std::mem::size_of::<ImVec4_Simple>(),
        16usize,
        concat!("Size of: ", stringify!(ImVec4_Simple))
    );
    assert_eq!(
        ::std::mem::align_of::<ImVec4_Simple>(),
        4usize,
        concat!("Alignment of ", stringify!(ImVec4_Simple))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec4_Simple>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec4_Simple),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec4_Simple>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec4_Simple),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec4_Simple>())).z as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec4_Simple),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImVec4_Simple>())).w as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ImVec4_Simple),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct ImColor_Simple {
    pub Value: ImVec4_Simple,
}
#[test]
fn bindgen_test_layout_ImColor_Simple() {
    assert_eq!(
        ::std::mem::size_of::<ImColor_Simple>(),
        16usize,
        concat!("Size of: ", stringify!(ImColor_Simple))
    );
    assert_eq!(
        ::std::mem::align_of::<ImColor_Simple>(),
        4usize,
        concat!("Alignment of ", stringify!(ImColor_Simple))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ImColor_Simple>())).Value as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ImColor_Simple),
            "::",
            stringify!(Value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImGuiContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ImDrawListSharedData {
    _unused: [u8; 0],
}
pub type ImTextureID = *mut ::std::os::raw::c_void;
pub type ImGuiID = ::std::os::raw::c_uint;
pub type ImWchar = ::std::os::raw::c_ushort;
pub type ImGuiCol = ::std::os::raw::c_int;
pub type ImGuiCond = ::std::os::raw::c_int;
pub type ImGuiDataType = ::std::os::raw::c_int;
pub type ImGuiDir = ::std::os::raw::c_int;
pub type ImGuiKey = ::std::os::raw::c_int;
pub type ImGuiMouseCursor = ::std::os::raw::c_int;
pub type ImGuiStyleVar = ::std::os::raw::c_int;
pub type ImDrawCornerFlags = ::std::os::raw::c_int;
pub type ImDrawListFlags = ::std::os::raw::c_int;
pub type ImFontAtlasFlags = ::std::os::raw::c_int;
pub type ImGuiBackendFlags = ::std::os::raw::c_int;
